var approvedMrkp = [
	[ 0, 3, 3, 'མདོ། བམ་', 'T.Gawa' ],
	[ 0, 4, 214, 'རྣམ་', 'T.Gawa' ],
	[ 5, 5, 238, 'མྱུར་', 'T.Gawa' ],
	[ 10, 5, 92, 'པའོ། །', 'T.Gawa' ],
	[ 8, 5, 162, 'འདྲ། །', 'T.Gawa' ],
	[ 7, 5, 168, 'ལྟར། །', 'T.Gawa' ]
];

var mrkpFromPr = [
	[ 0, 3, 3, 'མདོ། བམ་', 'kuns' ],
	[ 0, 3, 3, 'མདོ། བམ་', 'tnam' ],
	[ 4, 5, 65, 'དང། ', 'dhaming' ],
	[ 0, 4, 214, 'རྣམ་', 'dhaming' ],
	[ 10, 5, 92, 'པའོ། །', 'lakdor' ],
    [ 10, 5, 92, 'པའོ། །', 'kuns' ],
    [ 10, 5, 92, 'པའོ། །', 'tnam' ],
    [ 10, 5, 92, 'པའོ། །', 'dhaming' ],
    [ 9, 4, 156, 'ཏེ། །', 'dhaming' ],
    [ 8, 5, 162, 'འདྲ། །', 'tnam' ],
    [ 4, 2, 37, 'པ་ནིད་', 'tnam' ],
    [ 8, 5, 162, 'འདྲ། །', 'kuns' ],
    [ 7, 5, 168, 'ལྟར། །', 'dhaming' ],
    [ 7, 5, 168, 'ལྟར། །', 'lakdor' ],
    [ 7, 5, 168, 'ལྟར། །', 'tnam' ],
    [ 6, 6, 69, 'ཤིང། ', 'dhaming' ]
];

{ 'fakeData': 
   { allMrkp: { kuns: 3, tnam: 5, dhaming: 6, lakdor: 2 },
     approvedMrkp: { kuns: 3, tnam: 4, dhaming: 3, lakdor: 2 } } }